function setup() {
  // Canvas үүсгээд түүнийг хувьсагчид авна
  let cnv = createCanvas(1000, 550);
  
  // Canvas-ийг дэлгэцийн голд байрлуулах CSS стилийг шууд олгох
  cnv.style('display', 'block');
  cnv.style('margin', 'auto');
  
  noLoop(); // Зөвхөн нэг удаа зурна
}

function draw() {
  // Дээд талын тэнгэрийн дэвсгэр өнгө (Цайвар цэнхэр)
  background(140, 205, 240);

  // Хүрээний тохиргоо (Бараан хүрэн хүрээ)
  stroke(60, 25, 15);
  strokeWeight(7);

  // 1. Нар (Баруун дээд өнцөгт)
  fill(250, 225, 25);
  circle(850, 130, 130);

  // 2. Уулс (Ниолетан ягаан өнгөтэй гурвалжнууд)
  fill(125, 80, 145);
  triangle(180, 420, 310, 170, 480, 420);
  triangle(380, 420, 510, 90, 660, 420);
  triangle(580, 420, 710, 170, 830, 420);

  // 3. Үүлс (Цагаан дугуйнууд)
  fill(255);
  ellipse(150, 210, 90, 70);
  ellipse(220, 160, 90, 70);
  ellipse(220, 220, 90, 70);
  ellipse(280, 190, 90, 70);

  ellipse(370, 320, 65, 50);
  ellipse(415, 275, 65, 50);
  ellipse(415, 320, 65, 50);
  ellipse(455, 300, 65, 50);

  ellipse(560, 230, 100, 70);
  ellipse(635, 160, 90, 65);
  ellipse(635, 225, 90, 65);
  ellipse(700, 205, 80, 60);

  // 4. Ногоон толгод болон бутнууд
  fill(110, 175, 70);
  arc(300, 430, 600, 250, PI, 0);
  arc(550, 430, 500, 200, PI, 0);
  arc(750, 430, 400, 220, PI, 0);

  rect(190, 370, 200, 55, 25);
  rect(520, 370, 210, 55, 25);

  // 5. Моднууд
  drawTree(140, 350, 110, 35, 80);
  drawTree(190, 375, 90, 30, 70);
  drawTree(790, 375, 90, 30, 70);
  drawTree(860, 350, 120, 40, 85);

  // 6. Хамгийн доод талын ногоон судал
  fill(110, 175, 70);
  rect(75, 410, 850, 90);
}

function drawTree(x, y, canopySize, trunkW, trunkH) {
  fill(130, 75, 40);
  rect(x - trunkW / 2, y, trunkW, trunkH);
  
  fill(65, 115, 45);
  circle(x, y, canopySize);
}